LonelyWolf/stm32/bike-computer/main.c
// Turn on transceiver and configure it for RX mode
void nRF24_SetRXMode(void) {
	nRF24_Wake();
	nRF24_RXMode(
			nRF24_RX_PIPE0,           // RX on PIPE#0
			nRF24_ENAA_OFF,           // Auto acknowledgment
			nRF24_RF_CHANNEL,         // RF Channel
			nRF24_DataRate_250kbps,   // Data rate
			nRF24_CRC_on,             // CRC
			nRF24_CRC_1byte,          // CRC scheme
			(uint8_t *)nRF24_RX_Addr, // RX address
			nRF24_RX_Addr_Size,       // RX address size
			nRF24_RX_PAYLOAD,         // Payload length
			nRF24_TXPower_0dBm        // TX power for auto acknowledgment
			);
    nRF24_ClearIRQFlags();
    nRF24_FlushRX();
}

// Turn off transceiver
void nRF24_Sleep(void) {
	nRF24_PowerDown();
}

// Inquiry status of the button
void Button_Inquiry(BTN_TypeDef *button) {
	if (button->PORT->IDR & button->PIN) {
	    // Button released
		button->hold_cntr = 0;
		if (button->state != BTN_Hold) button->cntr++;
		button->state = BTN_Released;

		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;
	} else {
		// Button pressed
		button->hold_cntr = 0;
		button->state = BTN_Pressed;
		BEEPER_Enable(2000,5);
	}
	if (!_screensaver) UC1701_SetBacklight(Settings.LCD_brightness);
	_screensaver = FALSE;
	_idle_time = 0;
}


/////////////////////////////////////////////////////////////////////////


// EXTI[5..9] lines IRQ handler
void EXTI9_5_IRQHandler(void) {
	nRF24_RX_PCKT_TypeDef RX_status;

	if (EXTI_GetITStatus(EXTI_Line6) != RESET) {
		// EXTI6 (nRF24L01 IRQ)
		UC1701_PauseSPI();
		RX_status = nRF24_RXPacket(nRF24_RX_Buf,nRF24_RX_PAYLOAD);
		nRF24_ClearIRQFlags();
		UC1701_ResumeSPI();
		if (RX_status == nRF24_RX_PCKT_PIPE0) {
			ParsePacket();
			_no_signal_time = 0;
			// FIXME: with this enabled no menu/GUI timeout will happen in case of constant packets receiving
			if (_idle_time > Settings.LCD_timeout) _idle_time = Settings.LCD_timeout;
			BEEPER_Enable(444,1);
		}
		EXTI_ClearITPendingBit(EXTI_Line6);
	}

	if (EXTI_GetITStatus(EXTI_Line5) != RESET) {
		// EXTI5 (Button#1 -> "Up")
		Button_Inquiry(&BTN[BTN_UP]);
		EXTI_ClearITPendingBit(EXTI_Line5);
	}
}

// EXTI[10..15] lines IRQ handler
void EXTI15_10_IRQHandler(void) {
	if (EXTI_GetITStatus(EXTI_Line10) != RESET) {
		// EXTI10 (Button#3 -> "Enter")
		Button_Inquiry(&BTN[BTN_ENTER]);
		EXTI_ClearITPendingBit(EXTI_Line10);
	}

	if (EXTI_GetITStatus(EXTI_Line11) != RESET) {
		// EXTI11 (Button#4 -> "Escape")
		Button_Inquiry(&BTN[BTN_ESCAPE]);
		EXTI_ClearITPendingBit(EXTI_Line11);
	}

	if (EXTI_GetITStatus(EXTI_Line12) != RESET) {
		// EXTI12 (Button#2 -> "Down")
		Button_Inquiry(&BTN[BTN_DOWN]);
		EXTI_ClearITPendingBit(EXTI_Line12);
	}
}

// RTC wake-up IRQ handler
void RTC_WKUP_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_WUTF) {
		// RTC Wake-up interrupt
		RTC_GetDateTime(&RTC_Time,&RTC_Date);

		_no_signal_time++;
		_GPS_time_duty_cycle++;
		_altitude_duty_cycle++;
		_idle_time++;
		_new_time = TRUE;

		// Counters overflow protection  FIXME: is it really necessary?
		if (_no_signal_time > 36000) _no_signal_time = 36000;
		if (_idle_time > 36000) _idle_time = 36000;
		if (_GPS_time_duty_cycle > 36000) _GPS_time_duty_cycle = 36000;
		if (_altitude_duty_cycle > 36000) _altitude_duty_cycle = 36000;

		if (_no_signal_time > NO_SIGNAL_TIME) {
			CurData.Speed   = 0;
			CurData.Cadence = 0;
			_prev_cntr_SPD  = 0;
		}
		if (_idle_time > GUI_SCREENSAVER_TIMEOUT) _screensaver = TRUE; else _screensaver = FALSE;
		if (!_screensaver) {
			// The following procedures must be executed only when no screensaver active
			if (_idle_time > Settings.LCD_timeout && Settings.LCD_timeout) UC1701_SetBacklight(0); else UC1701_SetBacklight(Settings.LCD_brightness);
			// ATTENTION! BMP180 polling pretty slow!
			// Execute it from this place is really a bad idea!
//			if (_bmp180_present && _altitude_duty_cycle > ALT_MEASURE_DUTY_CYCLE) UpdateBMP180();
		}

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF; // Clear the RTC wake-up timer flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled
		EXTI_ClearITPendingBit(EXTI_Line20);
	}
}

// TIM7 IRQ handler
void TIM7_IRQHandler(void) {
	TIM7->SR &= ~TIM_SR_UIF; // Clear the TIM7's interrupt pending bit (TIM7 rises only UPDATE IT)
	if (_DMA_cntr == (uint16_t)DMA1_Channel6->CNDTR) {
		// DMA pointer unchanged from last IRQ -> UART timeout
		TIM7->CR1 &= (uint16_t)(~((uint16_t)TIM_CR1_CEN)); // Disable TIM7
		DMA1_Channel6->CCR &= (uint16_t)(~DMA_CCR6_EN); // Disable DMA
		// Copy rest of data from the FIFO buffer to the GPS buffer
		_DMA_cntr = FIFO_BUFFER_SIZE - (uint16_t)DMA1_Channel6->CNDTR;
		// Cut data buffer to prevent overflow
		if (GPS_buf_cntr + _DMA_cntr >= GPS_BUFFER_SIZE) _DMA_cntr = GPS_BUFFER_SIZE - GPS_buf_cntr;
		memcpy(&GPS_buf[GPS_buf_cntr],USART_FIFO,_DMA_cntr);
		GPS_buf_cntr += _DMA_cntr;
		_DMA_cntr = 0;
		ParseGPS(); // About 3ms with full buffer
		// Enable USART2 RX complete interrupt when GPS data is parsed (ready to get new)
		UART_PORT->CR1 |= USART_CR1_RXNEIE;
	} else {
		// Data still coming from USART
		_DMA_cntr = (uint16_t)DMA1_Channel6->CNDTR;
	}
}

// USART2 IRQ handler
void USART2_IRQHandler(void) {
	if (UART_PORT->SR & USART_SR_RXNE) {
		// Received data ready to be read
		UART_PORT->CR1 &= ~USART_CR1_RXNEIE; // Disable USART2 RX complete interrupt
		DMA1_Channel6->CCR  &= (uint16_t)(~DMA_CCR6_EN); // Disable DMA (it should be disabled though)
		DMA1_Channel6->CNDTR = FIFO_BUFFER_SIZE;
		DMA1_Channel6->CCR  |= DMA_CCR6_EN; // Enable DMA
		TIM7->CR1 |= TIM_CR1_CEN; // Enable TIM7
	}
}


// UART2_RX DMA IRQ handler
void DMA1_Channel6_IRQHandler() {
	uint16_t b_rcvd;

	if (DMA1->ISR & DMA_ISR_TCIF6) {
		// Channel 6 transfer complete
		DMA1->IFCR = DMA_IFCR_CTCIF6; // Clear DMA1 channel6 transfer complete flag
		// Amount of received data (in fact should be equal to FIFO_BUFFER_SIZE)
		b_rcvd = FIFO_BUFFER_SIZE - (uint16_t)DMA1_Channel6->CNDTR;
		// Prevent data buffer overflow
		if (GPS_buf_cntr + b_rcvd >= GPS_BUFFER_SIZE) b_rcvd = GPS_BUFFER_SIZE - GPS_buf_cntr;
		memcpy(&GPS_buf[GPS_buf_cntr],USART_FIFO,b_rcvd); // Copy data to the GPS buffer
		GPS_buf_cntr += b_rcvd;
		DMA1_Channel6->CCR  &= (uint16_t)(~DMA_CCR6_EN); // Disable DMA (to reload counter value)
		DMA1_Channel6->CNDTR = FIFO_BUFFER_SIZE; // Reload DMA counter
		// If the data buffer is full the DMA should remain disabled until the buffer is processed.
		if (GPS_buf_cntr <= GPS_BUFFER_SIZE) DMA1_Channel6->CCR |= DMA_CCR6_EN; // Enable DMA
	};
}


/////////////////////////////////////////////////////////////////////////


// Callback function for delay timer overflow IRQ
void callback_Delay(void) {
	uint8_t i;

	// Check if a buttons is in hold state
	for (i = 0; i < 4; i++) {
		if (!(BTN[i].PORT->IDR & BTN[i].PIN)) {
			BTN[i].hold_cntr++;
			if (BTN[i].hold_cntr > 3) BTN[i].state = BTN_Hold;
		}
	}

	// Disable sleep-on-exit for return to main loop
	SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

	// Set GUI refresh flag (twice per second)
	GUI_refresh = TRUE;
}


/////////////////////////////////////////////////////////////////////////


// Parse received nRF24L01 data packet
void ParsePacket(void) {
	uint32_t diff_SPD;
	uint32_t i;

	// memcpy doesn't work here due to struct alignments
	nRF24_Packet.cntr_SPD  = (nRF24_RX_Buf[0] << 8) + nRF24_RX_Buf[1];
	nRF24_Packet.tim_SPD   = (nRF24_RX_Buf[2] << 8) + nRF24_RX_Buf[3];
	nRF24_Packet.tim_CDC   = (nRF24_RX_Buf[4] << 8) + nRF24_RX_Buf[5];
	nRF24_Packet.vrefint   = ((nRF24_RX_Buf[6] & 0x03) << 8) + nRF24_RX_Buf[7];
	nRF24_Packet.cntr_wake = (nRF24_RX_Buf[8] << 8) + nRF24_RX_Buf[9];

	// Convert SPD impulses period into speed
	if (nRF24_Packet.tim_SPD > 0) {
//		CurData.Speed = Settings.WheelCircumference * (992.9696969 * 0.36) / nRF24_Packet.tim_SPD;
//		CurData.Speed = (Settings.WheelCircumference * 357.469090884) / nRF24_Packet.tim_SPD;
//		CurData.Speed = Settings.WheelCircumference * (1007.08 * 0.36) / nRF24_Packet.tim_SPD;
		CurData.Speed = (Settings.WheelCircumference * 362.5488) / nRF24_Packet.tim_SPD;
		if (CurData.Speed > 999) CurData.Speed = 999; // Maximum 99.9km/h can be displayed
	} else CurData.Speed = 0;

	// Convert CDC impulses period into cadence
	if (nRF24_Packet.tim_CDC > 0) {
//		CurData.Cadence = (uint32_t)((60.0 / nRF24_Packet.tim_CDC) * 992.9696969);
//		CurData.Cadence = (uint32_t)(59578.181814 / nRF24_Packet.tim_CDC);
//		CurData.Cadence = (uint32_t)((60.0 / nRF24_Packet.tim_CDC) * 1007.08);
		CurData.Cadence = (uint32_t)(60424.8 / nRF24_Packet.tim_CDC);
		// TODO: filter some crazy high values
	} else CurData.Cadence = 0;

	// Average cadence from last five values
	memmove(&_cdc[1],&_cdc[0],sizeof(_cdc) - sizeof(*_cdc));
	_cdc[0] = CurData.Cadence;
	_cdc_avg = 0;
	for (i = 0; i < 5; i++) _cdc_avg += _cdc[i];
	_cdc_avg /= 5;

	// Update maximum values
	if (CurData.Speed > CurData.MaxSpeed) CurData.MaxSpeed = CurData.Speed;
	if (CurData.Cadence > CurData.MaxCadence) CurData.MaxCadence = CurData.Cadence;

	// Update current trip time
	// Transceiver send packet every second, so don't fuss and simply add one second to trip time
	CurData.TripTime++;
/*
	if (nRF24_Packet.tim_SPD != _prev_tim_SPD) {
	if (nRF24_Packet.tim_SPD < 1007) {
		// Pulse interval was shorter than one second therefore just
		// add one second to the trip counter
		CurData.TripTime++;
	} else {
		// Pulse interval was longer than one second, therefore convert it
		// to seconds and remember fractional part for further usage
		tmp = (nRF24_Packet.tim_SPD / 1007.08) + (_tim_excess / 1000.0);
		CurData.TripTime += (uint32_t)tmp;
		_tim_excess = (uint32_t)(tmp * 1000) - ((uint32_t)tmp * 1000);
	}
	_prev_tim_SPD  = nRF24_Packet.tim_SPD;
*/

	// Update odometer and current trip distance
	if (nRF24_Packet.cntr_SPD != 0 && nRF24_Packet.cntr_SPD != _prev_cntr_SPD) {
		if (nRF24_Packet.cntr_SPD >= _prev_cntr_SPD) {
			diff_SPD = nRF24_Packet.cntr_SPD - _prev_cntr_SPD;
		} else {
			diff_SPD = 65535 - _prev_cntr_SPD + nRF24_Packet.cntr_SPD;
		}
		CurData.dbg_cntr_diff = diff_SPD;
		if (diff_SPD > 1000) diff_SPD = 1; // FIXME: this is lame workaround for crazy values
		CurData.Odometer += Settings.WheelCircumference * diff_SPD;
		CurData.TripDist += Settings.WheelCircumference * diff_SPD;
	} else {
		CurData.dbg_cntr_diff = 0;
	}
	_prev_cntr_SPD = nRF24_Packet.cntr_SPD;
	CurData.dbg_prev_cntr = _prev_cntr_SPD;

	// Update average values
	CurData.AvgSpeed = (uint32_t)((CurData.TripDist * 0.36) / CurData.TripTime);
	if (CurData.Cadence > 0) {
		// A simple calculation of the average cadence.
		_cntr_cadence++;
		// At constant value of cadence 300RPM this accumulator will overflow
		// after about 4000 hours of ride
		_cadence_accum += CurData.Cadence;
		CurData.AvgCadence = _cadence_accum / _cntr_cadence;
	}

	_new_packet = TRUE;
}

// Parse GPS data
void ParseGPS(void) {
	GPS_InitData(); // Clear previously parsed GPS data
	while (GPS_msg.end < GPS_buf_cntr) {
		GPS_FindSentence(&GPS_msg,GPS_buf,GPS_msg.end,GPS_buf_cntr);
		if (GPS_msg.type != NMEA_BAD) {
			GPS_sentences_parsed++;
			GPS_ParseSentence(GPS_buf,&GPS_msg);
		} else GPS_sentences_unknown++;
	}
	GPS_buf_cntr = 0;
	if (GPS_sentences_parsed) {
		GPS_CheckUsedSats();
		if (GPSData.fix == 3) {
			// GPS altitude makes sense only in case of 3D fix
			CurData.GPSAlt = GPSData.altitude;
			if (CurData.GPSAlt > CurData.MaxGPSAlt) CurData.MaxGPSAlt = CurData.GPSAlt;
			if (CurData.GPSAlt < CurData.MinGPSAlt) CurData.MinGPSAlt = CurData.GPSAlt;
		}
		if (GPSData.fix == 2 || GPSData.fix == 3) {
			// GPS speed makes sense only in case of 2D or 3D position fix
			CurData.GPSSpeed = GPSData.speed;
			if (CurData.GPSSpeed > CurData.MaxGPSSpeed) CurData.MaxGPSSpeed = CurData.GPSSpeed;
		}
		GPS_new_data = TRUE;
	}
}

