LonelyWolf/stm32/bike-computer/main.c
// Update data from BMP180
// return: TRUE if data acquired successfully, FALSE otherwise
// note: really slow routine
bool UpdateBMP180(void) {
	bool result = FALSE;
	int16_t _raw_temp;
	int32_t _raw_press;

	if (_bmp180_present) {
		// TODO: it is worth trying to use the I2C IRQ instead of polling the I2C flags?
		if (BMP180_GetReadings(&_raw_temp,&_raw_press,BMP180_UHIRES)) {  // <--- UHIRES mode takes about 28ms
//		if (BMP180_GetReadings(&_raw_temp,&_raw_press,BMP180_ADVRES)) {  // <--- ADVRES mode takes about 80ms
			CurData.Temperature = _raw_temp;
			if (CurData.Temperature > CurData.MaxTemperature) CurData.MaxTemperature = CurData.Temperature;
			if (CurData.Temperature < CurData.MinTemperature) CurData.MinTemperature = CurData.Temperature;

			CurData.Pressure = _raw_press;
			if (CurData.Pressure > CurData.MaxPressure) CurData.MaxPressure = CurData.Pressure;
			if (CurData.Pressure < CurData.MinPressure) CurData.MinPressure = CurData.Pressure;

			CurData.Altitude = BMP180_hPa_to_Altitude(CurData.Pressure);
			if (CurData.Altitude > CurData.MaxAltitude) CurData.MaxAltitude = CurData.Altitude;
			if (CurData.Altitude < CurData.MinAltitude) CurData.MinAltitude = CurData.Altitude;

			memmove(&altitude_history[1],&altitude_history[0],sizeof(altitude_history) - sizeof(*altitude_history));
			altitude_history[0] = CurData.Altitude;

			// Reset this counter only if readings obtained successfully, otherwise next try will be on next cycle
			_altitude_duty_cycle = 0;

			GUI_new_BMP180 = TRUE;
			result = TRUE;
		}
	}
	return result;
}


/////////////////////////////////////////////////////////////////////////


int main(void) {
	// Update SystemCoreClock according to Clock Register Values
	SystemCoreClockUpdate();

#ifdef DEBUG
	// Enable debugging when the MCU is in low power modes
	DBGMCU->CR |= DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY;
#endif

/////////////////////////////////////////////////////////////////////////
//  Boot section
/////////////////////////////////////////////////////////////////////////

	// Variables initialization ------------------------------
	memset(&nRF24_RX_Buf,0,nRF24_RX_PAYLOAD);
	memset(&nRF24_Packet,0,sizeof(nRF24_Packet));
	memset(&CurData,0,sizeof(CurData));
	memset(&altitude_history,0,sizeof(altitude_history));
	memset(&GPS_buf,0,sizeof(GPS_buf));
	memset(&USART_FIFO,0,FIFO_BUFFER_SIZE);
	memset(&_cdc,0,sizeof(_cdc));
	GPS_InitData();

	_new_packet     = FALSE;
	_new_time       = FALSE;
	_screensaver    = FALSE;
	_bmp180_present = FALSE;
	_SD_present     = FALSE;
	_logging        = FALSE;
	_RF_icon        = TRUE;
	GPS_new_data    = FALSE;
	GPS_buf_cntr    = 0;
	_DMA_cntr       = 0;
	_prev_cntr_SPD  = 0;
	_prev_tim_SPD   = 0;
	_tim_excess     = 0;
	_cntr_cadence   = 0;
	_cadence_accum  = 0;
	_no_signal_time = 65535;
	_idle_time      = 0;
	_cdc_avg        = 0;
	_altitude_duty_cycle = ALT_MEASURE_DUTY_CYCLE + 1;
	_GPS_time_duty_cycle = GPS_TIME_SYNC_DUTY_CYCLE + 1;
	CurData.MinGPSAlt = 0x7FFFFFFF; // LONG_MAX - first time when altitude will be acquired it becomes normal value

	// Buttons initialization
	for (i = 0; i < 4; i++) memset(&BTN[i],0,sizeof(BTN[i]));
	BTN[0].PORT = BTN0_PORT;
	BTN[0].PIN  = BTN0_PIN;
	BTN[1].PORT = BTN1_PORT;
	BTN[1].PIN  = BTN1_PIN;
	BTN[2].PORT = BTN2_PORT;
	BTN[2].PIN  = BTN2_PIN;
	BTN[3].PORT = BTN3_PORT;
	BTN[3].PIN  = BTN3_PIN;

	// These values stored in EEPROM
	Settings.GMT_offset = 3;
	Settings.WheelCircumference = 206;
	Settings.altitude_home = 178;
	Settings.LCD_brightness = 50;
	Settings.LCD_timeout = 30;

	// Read settings from EEPROM
	ReadBuffer_EEPROM(DATA_EEPROM_START_ADDR,(uint32_t *)&Settings,sizeof(Settings));

	// -------------------- end of variables initialization

	InitPeripherals();

	// Boot screen
	UC1701_Fill(0x00);
	GUI_DrawBitmap(98,39,30,25,&bmp_bike_man[0]);
	PutStr(104,0,"WBC",fnt7x10);

	i  = PutStr(0,scr_height - 15,"CPU:",fnt5x7) - 1;
	i += PutIntF(i,scr_height - 15,SystemCoreClock / 1000,3,fnt5x7);
	PutStr(i,scr_height - 15,"MHz",fnt5x7);
	UC1701_Flush();

	i = PutStr(0,scr_height - 7,"STAT:",fnt5x7) - 1;
	PutStr(i,scr_height - 7,GPIO_ReadInputDataBit(GPIOA,GPIO_Pin_15) == Bit_RESET ? "0" : "1",fnt5x7);

	// Init the RTC and configure it clock to LSE
	i = PutStr(0,0,"LSE:",fnt5x7) - 1;
	UC1701_Flush();
	RTC_Config();
	PutStr(i,0,"OK",fnt5x7);
	UC1701_Flush();

	// Configure nRF24L01+
	i = PutStr(0,8,"nRF24L01:",fnt5x7) - 1;
	UC1701_Flush();
    nRF24_init();
    if (nRF24_Check()) {
    	nRF24_SetRXMode();
    	PutStr(i,8,"OK",fnt5x7);
    	UC1701_Flush();
    } else {
    	PutStr(i,8,"Fail",fnt5x7);
        UC1701_Flush();
        _screensaver = TRUE;
    	while(1) SleepStop(); // Infinite deep sleep
    }

    // I2C2 port initialization
    PutStr(0,16,"BMP180:",fnt5x7);
    UC1701_Flush();
    // I2C fast mode (400kHz)
    if (I2C2_Init(400000) == I2C_SUCCESS) {
        BMP180_Reset(); // Send reset command to BMP180
        Delay_ms(15); // Wait for BMP180 startup time (10ms by datasheet)
        if (BMP180_Check() == BMP180_SUCCESS) {
    		_bmp180_present = TRUE;
    		PutChar(42,16,'v',fnt5x7);
    		i = BMP180_GetVersion();
    		PutInt(48,16,i,fnt5x7);
    		BMP180_ReadCalibration();
			CurData.MinTemperature =  32767;
			CurData.MaxTemperature = -32767;
			CurData.MinPressure = 2147483647; // LONG_MAX - it becomes normal when the pressure will be acquired normally first time
    		if (UpdateBMP180()) {
        		GUI_PutTemperature(60,16,CurData.Temperature,fnt5x7);
        		GUI_PutPressure(60,24,CurData.Pressure,PT_mmHg,fnt5x7);
        		altitude_history[0] = BMP180_hPa_to_Altitude(CurData.Pressure);
    		} else {
    			PutStr(60,16,"Readings",fnt5x7);
    			PutStr(60,24,"failed",fnt5x7);
    		}
    	} else {
    		PutStr(42,16,"Not present",fnt5x7);
    	}
    } else {
    	PutStr(42,16,"I2C timeout",fnt5x7);
    }
	UC1701_Flush();

	// Initialization of SD card
	i = PutStr(0,32,"SD:",fnt5x7) - 1;
	UC1701_Flush();
	j = (uint32_t)SD_Init();
	if (j == SDR_Success) {
		_SD_present = TRUE;
		i += PutChar(i,32,'v',fnt5x7);
		i += PutInt(i,32,SDCard.CardType,fnt5x7) + 5;
		if (SDCard.CardType == SDCT_SDHC) {
			i += PutInt(i,32,SDCard.CardCapacity / 1024,fnt5x7);
		} else {
			i += PutInt(i,32,SDCard.CardCapacity / 1048576,fnt5x7);
		}
		PutStr(i,32,"Mb",fnt5x7);

		// Logging initialization (check for the file system)
		i = PutStr(0,40,"LOG:",fnt5x7) - 1;
		UC1701_Flush();
		j = LOG_Init();
		if (j == LOG_OK) {
			PutStr(i,40,"OK",fnt5x7);
		} else {
			PutHex(i,40,j,fnt5x7);
		}
	} else {
		PutHex(i,32,j,fnt5x7);
	}
	UC1701_Flush();

	// Set time only in case of POR (power on reset)
	if (RCC->CSR & RCC_CSR_PORRSTF) {
		_time.RTC_Hours   = 0;
		_time.RTC_Minutes = 0;
		_time.RTC_Seconds = 0;
		_date.RTC_Date    = 16;
		_date.RTC_Month   = 04;
		_date.RTC_Year    = 14;
		_date.RTC_WeekDay = 3;
		RTC_SetDateTime(&_time,&_date);
	}
	RTC_GetDateTime(&RTC_Time,&RTC_Date);
	RCC->CSR |= RCC_CSR_RMVF; // Clear the reset flags

	ccc = 0;

	// Reinitialize delay timer with callback function
	Delay_Init(callback_Delay);

	// Configure wake-up timer to wake every second and enable it
	RTC_SetWakeUp(1);

	// Initialize GPS module
	GPS_Init();

	// Boot complete, do some noise
	BEEPER_PlayTones(tones_startup);


/////////////////////////////////////////////////////////////////////////
//	Main loop
/////////////////////////////////////////////////////////////////////////

	while(1) {
		if (_screensaver) {
			RTC_SetWakeUp(GUI_SCREENSAVER_UPDATE);
			nRF24_Sleep(); // Turn off the receiver
			GPS_SendCommand(PMTK_CMD_STANDBY_MODE); // Put GPS module into standby mode (not supported by EB-500)
			UC1701_SetBacklight(0);

			GUI_ScreenSaver();

 			// Reinitialize display
 			Display_Init();
			UC1701_Fill(0x00);

